atmosphere/tutorials/ce3/currentT400_NO_AMR/rtb3D_NO_AMR/RTB3D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
160000
(
299.80380000000002383
299.80380000000002383
299.80380000000002383
299.80380000000002383
299.80380000000002383
299.80380000000002383
299.80380000000002383
299.80380000000002383
...
)
;

boundaryField
{
    top
    {
        type            fixedGradient;
        gradient        uniform -0.00981;
    }
    bottom
    {
        type            fixedGradient;
        gradient        uniform 0.00981;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            symmetryPlane;
    }
    back
    {
        type            zeroGradient;
    }
    front
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
