atmosphere/tutorials/ce3/currentT400_NO_AMR/rtb3D_NO_AMR/RTB3D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        
        type           slip;
    }

    bottom
    {
 
        type            slip; 
    }


    left
    {
        type           slip;
    }
    
    back
    {
        type           slip;
    }
    
    "(front|right)"
    {
        type            symmetryPlane;
    }
        
}

// ************************************************************************* //
