atmosphere/tutorials/ce3/currentT400_NO_AMR/rtb3D_NO_AMR/RTB3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)        //0
    (1600 0 0)     //1
    (1600  4000 0)  //2
    (0 4000 0)     //3
    (0 0 1600)        //4
    (1600 0 1600)     //5
    (1600  4000 1600)  //6
    (0 4000 1600)     //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 100 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
         type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (0 4 5 1)
        );
    }
    left
    {
        type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type symmetryPlane;
        //neighbourPatch bottom;
        faces
        (
            (1 5 6 2)
        );
    }

    back
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    
     front
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
